In [2]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings("ignore")
#from jupyterthemes import get_themes
#import jupyterthemes as jt
#from jupyterthemes.stylefx import set_nb_theme
#set_nb_theme('oceans16')
#!jt -l

Data Structures:
+ Series (1d), 
+ DataFrames (2d), 
+ Panel (MultiDimensions)

In [3]:
data = np.array(['c','i','g','a','r'])
ser = pd.Series(data)
print(ser)

0    c
1    i
2    g
3    a
4    r
dtype: object

In [6]:
dic = {1:'C',2:'I',3:'G',4:'A',5:'R'}
pd.Series(dic)

1    C
2    I
3    G
4    A
5    R
dtype: object

In [7]:
dic = {'C':1,'I':2,'G':3,'A':4,'R':5}
pd.Series(dic['I'])

0    2
dtype: int64

In [8]:
data = np.array(['c','i','g','a','r'])
z = pd.Series(data)
z[3]

'a'

In [9]:
data = np.array(['c','i','g','a','r'])
z = pd.Series(data)
z[3:]

3    a
4    r
dtype: object

In [10]:
data = np.array(['c','i','g','a','r'])
z = pd.Series(data)
z[:3]

0    c
1    i
2    g
dtype: object

In [11]:
data = np.array(['c','i','g','a','r'])
z = pd.Series(data, index = [1,2,3,4,5])
z

1    c
2    i
3    g
4    a
5    r
dtype: object

Attributes:
+ Index
+ Shape
+ dtype
+ size
+ empty
+ hasnans
+ nbytes
+ ndim
+ itemsize

In [12]:
x = pd.Series([1,2,3,4,None])
print(x.index)
print(x.values)
print(x.dtype)
print(x.size)
print(x.shape)
print(x.empty)
print(x.hasnans)
print(x.nbytes)
print(x.ndim)

RangeIndex(start=0, stop=5, step=1)
[ 1.  2.  3.  4. nan]
float64
5
(5,)
False
True
40
1

In [10]:
x = pd.Series([1,2,0,4,None])
print(x,'\n')
print(x.index)
print(x.values)
print(x.dtype)
print(x.size)
print(x.shape)
print(x.empty)
print(x.hasnans)
print(x.nbytes)
print(x.ndim)

0    1.0
1    2.0
2    0.0
3    4.0
4    NaN
dtype: float64

RangeIndex(start=0, stop=5, step=1)
[ 1.  2.  0.  4. nan]
float64
5
(5,)
False
True
40
1

In [13]:
#Series.map()
a = pd.Series(['Lin','Jeg','Kedh','Gan'])
a.map({'Lin':'Lol'})

0    Lol
1    NaN
2    NaN
3    NaN
dtype: object

In [14]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [30]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'], dtype = int)
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [57]:
dat = {'Alex':10,'Bob':12,'Clarke':13}
df = pd.DataFrame(dat, columns=['Name','Age'])
df

Empty DataFrame
Columns: [Name, Age]
Index: []

In [37]:
df = {'Name':['Alex','Bob','Clarke'],'Age':[10,12,13]}
df = pd.DataFrame(df)
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [43]:
df = {'Name':['Linkedh','Jack','Steve','Jhon'],'Age':[28,34,29,40]}
df = pd.DataFrame(df, index = ['Rank 1','Rank 2','Rank 3','Rank 4'])
df

           Name  Age
Rank 1  Linkedh   28
Rank 2     Jack   34
Rank 3    Steve   29
Rank 4     Jhon   40

In [59]:
dat = [{'Alex':10,'Bob':12,'Clarke':13}]
df = pd.DataFrame(dat)
df

   Alex  Bob  Clarke
0    10   12      13

### Column Operation
+ Selection
+ Addition
+ Deletion

In [82]:
df = {'one':pd.Series([1,2,3,4],index=['a','b','c','d']),'two':pd.Series([5,6,7,8],index=['a','b','c','d'])}
df = pd.DataFrame(df)
df

   one  two
a    1    5
b    2    6
c    3    7
d    4    8

In [79]:
pd.DataFrame(df)['one']

a    1
b    2
c    3
d    4
Name: one, dtype: int64

In [81]:
pd.DataFrame(df)['two']

a    5
b    6
c    7
d    8
Name: two, dtype: int64

In [87]:
df = {'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
pd.DataFrame(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [100]:
#Adding a new column to an existing DataFrame
df = {'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
df = pd.DataFrame(df)
print(df)
df['Three'] = pd.Series([10,20,30],index=['a','b','c'])
print(df)
df['Total'] = df['one'] + df['two'] + df['Three']
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
   one  two  Three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN
   one  two  Three  Total
a  1.0    1   10.0   12.0
b  2.0    2   20.0   24.0
c  3.0    3   30.0   36.0
d  NaN    4    NaN    NaN

In [101]:
#Deleting columns
print(df)
del df['Total'] #or df.pop
print(df)

   one  two  Three  Total
a  1.0    1   10.0   12.0
b  2.0    2   20.0   24.0
c  3.0    3   30.0   36.0
d  NaN    4    NaN    NaN
   one  two  Three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

### Row Operation
+ Addition
+ Selection
+ Deletion

In [104]:
df = {'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
pd.DataFrame(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [107]:
df1 = pd.DataFrame(df, index = ['d','b','a'])
df1

   one  two
d  NaN    4
b  2.0    2
a  1.0    1

In [113]:
df['three'] = pd.Series([10,20,30],index=['a','b','c'])
df2 = pd.DataFrame(df, index = ['b','a'], columns = ['two','three'])
df2

   two  three
b    2     20
a    1     10

In [125]:
df = {'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
z = pd.DataFrame(df)
print(z[0:3],'\n')
print(z[0:3]['one'])

   one  two
a  1.0    1
b  2.0    2
c  3.0    3

a    1.0
b    2.0
c    3.0
Name: one, dtype: float64

In [128]:
dict = {'Name':['Martha','Tim','Ron','Georgia'],'Maths':[90,80,70,60],'Science':[90,80,70,60],'English':[90,80,70,60]}
z = pd.DataFrame(dict)
z

      Name  Maths  Science  English
0   Martha     90       90       90
1      Tim     80       80       80
2      Ron     70       70       70
3  Georgia     60       60       60

In [138]:
zf = {'Name':'Rocky','Maths':90,'Science':80,'English':70}
df = z.append(zf, ignore_index=True)
df

      Name  Maths  Science  English
0   Martha     90       90       90
1      Tim     80       80       80
2      Ron     70       70       70
3  Georgia     60       60       60
4    Rocky     90       80       70

In [139]:
df = df.drop(0)
df

      Name  Maths  Science  English
1      Tim     80       80       80
2      Ron     70       70       70
3  Georgia     60       60       60
4    Rocky     90       80       70

### Exercises

Q.1-	Given the following Series1
+ A	100
+ B	200
+ C	300
### Write the command to create above Series and then double the value in series and store in another series named Series2

In [144]:
series = pd.Series([100,200,300], index = ['A','B','C'])
print(series)
series2 = 2*series
print(series2)

A    100
B    200
C    300
dtype: int64
A    200
B    400
C    600
dtype: int64

Q.2-	State whether True or False
+ a.	A series object is size mutable.
+ b.	A Dataframe object is value mutable

In [ ]:
#a - True
#b - True

Q.3-	Consider a given Series , Series1: 
+ 200	700
+ 201	700
+ 202	700
+ 203	700
+ 204	700
### Write a program in Python Pandas to create the series and display it.

In [147]:
series = pd.Series([700,700,700,700,700], index = ['200','201','202','203','204'])
print(series)

200    700
201    700
202    700
203    700
204    700
dtype: int64

Q.4-	Consider the following Series object, 
+ s IP	95
+ Physics	89
+ Chemistry	92
+ Math	95
+ i.	Write the Python syntax which will display only IP.
+ ii.	Write the Python syntax to increase marks
of all subjects by 10.

In [167]:
#series = pd.Series([95,89,92,95], index = ['IP','Physics','Chemistry','Math'])
#print(series)
df = {'Subjects':pd.Series(['IP','Physics','Chemistry','Math']),'Marks':pd.Series([95,89,92,95])}
series = pd.DataFrame(df)
series

    Subjects  Marks
0         IP     95
1    Physics     89
2  Chemistry     92
3       Math     95

In [173]:
df = pd.DataFrame(series)['Subjects'][0:1]
print(df)

0    IP
Name: Subjects, dtype: object

In [178]:
series['Marks'] = series['Marks'] + 10
series

    Subjects  Marks
0         IP    115
1    Physics    109
2  Chemistry    112
3       Math    115

Q.5-	Consider a given series : SQTR
+ QTR1	50000
+ QTR2	65890
+ QTR3	56780
+ QTR4	89000
+ QTR5	77900
### Write a program in Python Pandas to create and display the series.

In [164]:
s = pd.Series([50000,65890,56780,89000,77900], index = ['QTR1','QTR2','QTR3','QTR4','QTR5'])
s

QTR1    50000
QTR2    65890
QTR3    56780
QTR4    89000
QTR5    77900
dtype: int64

##### Q.6-	What will be the output produced by the following programming statements 1 & 2? 
##### import pandas as pd 
##### S1=pd.Series(data=[31,41,51]) 
##### -->Statement1
##### print(S1>40)
##### -->Statement2
##### print(S1[S1>40])

In [183]:
s1 = pd.Series(data = [31,41,51])
print(s1 > 40,'\n')
print(s1[s1 > 40])

0    False
1     True
2     True
dtype: bool

1    41
2    51
dtype: int64

##### Q.7-	Given two series S1 and S2
+ A	39	A	10
+ B	41	B	10
+ C	42	D	10
+ D	44	F	10
##### Find the output for following python pandas statements?
+ a. S1[ : 2]*100
+ b.  S1 * S2
+ c. S2[ : : -1]*10

In [188]:
s1 = pd.Series([39,41,42,44],index = ['A','B','C','D'])
s2 = pd.Series([10,10,10,10],index = ['A','B','C','D'])

In [191]:
s1[:2]*100

A    3900
B    4100
dtype: int64

In [193]:
s1*s2

A    390
B    410
C    420
D    440
dtype: int64

In [194]:
s2[::-1]*10

D    100
C    100
B    100
A    100
dtype: int64

##### Q.8-	Given the following Series S1 and S2:

+ A	10	A	5
+ B	20	B	4
+ C	30	C	6
+ D	40	D	8
##### Write the command to find the multiplication of series S1 and S2

In [196]:
s1 = pd.Series([10,20,30,40],index = ['A','B','C','D'])
s2 = pd.Series([5,4,6,8],index = ['A','B','C','D'])

In [198]:
s1*s2

A     50
B     80
C    180
D    320
dtype: int64

##### Q.9-	Consider a given Series , Subject: 
+ ENGLISH 75
+ HINDI	78
+ MATHS	82
+ SCIENCE 86
##### Write a program in Python Pandas to create this series

In [205]:
s1 = pd.Series([75,78,82,86],index = ['ENGLISH','HINDI','MATHS','SCIENCE'])
s1

ENGLISH    75
HINDI      78
MATHS      82
SCIENCE    86
dtype: int64

##### Q.10-	Consider the following Series object, “company” and its profit in Crores
+ TCS	350
+ Reliance	200
+ L&T	800
+ Wipro	150
+ i. Write the command which will display the
	name of the company having profit>250.
+ ii. Write the command to name the series as
	Profit.

In [216]:
c = pd.Series([350,200,800,150],index = ['TCS','Reliance','L&T','Wipro'])
print(c[c > 250],'\n')
Profit = c
print(Profit)

TCS    350
L&T    800
dtype: int64

TCS         350
Reliance    200
L&T         800
Wipro       150
dtype: int64

##### Q.11-	Consider two objects a and b.
##### a is a list whereas b is a Series. Both have values 10,20,25,50.
##### What will be the output of the following two statements considering that the above objects have been created already
##### a. print(a*2)	b. print(b*2) Justify your answer.

In [219]:
a2 = [10,20,25,50]
b2 = pd.Series([10,20,25,50])
print(a2)
print(b2)

[10, 20, 25, 50]
0    10
1    20
2    25
3    50
dtype: int64

##### Q.12-	Given a Pandas series called Sample, the command which will display the last 3 rows is .
+ a.	print(Sample.tail(3))
+ b.	print(Sample.Tail(3))
+ c.	print(Sample.tails(3)
+ d.	print(Sample.Tails(3))

In [226]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,0])
print(Sample.tail(3))

7    8
8    9
9    0
dtype: int64

##### Q.13-	What will be the output of the following code?
+ import pandas as pd
+ s = pd.Series(6,index=range(0,5)) print(s)

In [227]:
s = pd.Series(6,index=range(0,5)) 
print(s)

0    6
1    6
2    6
3    6
4    6
dtype: int64

##### Q.14-	If series s1 is having following data,
 
##### What would be the result of the command
+ print(s1[3:6])?

In [229]:
s1 = pd.Series([1,2,3,4,5,6,7,8,9,0])
print(s1[3:6])

3    4
4    5
5    6
dtype: int64

##### Q.15-	What will be the output of the following code?
+ import pandas as pd 
+ import numpy as np
+ s = pd.Series(np.arange(10,50,10)) 
+ print(s)
+ print(s.ndim) 
+ print(s.shape) 
+ print(len(s))

In [230]:
s = pd.Series(np.arange(10,50,10)) 
print(s)
print(s.ndim) 
print(s.shape) 
print(len(s))

0    10
1    20
2    30
3    40
dtype: int32
1
(4,)
4

##### Q.16-	Write a program to create a Series having 10 random numbers in the range of 10 and 20

In [237]:
pd.Series(np.random.randint(size = 10,low = 10,high = 20))

0    13
1    10
2    13
3    12
4    11
5    16
6    17
7    12
8    11
9    13
dtype: int32

##### Q.17-	Consider the following Series ‘s’- 0	4.0
+ 1	5.0
+ 2	7.0
+ 3	NaN
+ 4	1.0
+ 5	10.0
+ dtype: float64
+ (i)	Write a Python code to add 1 to all the elements.
+ (ii)	Write a code to replace all NaN with 0.

In [255]:
a = pd.Series([5.0,7.0,np.nan,1.0,10.0],index = ['1','2','3','4','5'])
a

1     5.0
2     7.0
3     NaN
4     1.0
5    10.0
dtype: float64

In [257]:
a = a + 1
print(a)
a = a.fillna(0)
print(a)

1     6.0
2     8.0
3     NaN
4     2.0
5    11.0
dtype: float64
1     6.0
2     8.0
3     0.0
4     2.0
5    11.0
dtype: float64

##### Q.18-	Predict the output of the following code. 
+ import pandas as pd
+ import numpy as np
+ data = {'one':'a','two':'b','three':'c'} 
+ s=pd.Series(data)
+ print(s) 
+ print(s.size)

In [258]:
#Series and 3.
data = {'one':'a','two':'b','three':'c'} 
s=pd.Series(data)
print(s) 
print(s.size)

one      a
two      b
three    c
dtype: object
3

##### Q.19-	Create a Series object S1 using a python sequence [2,4,6,8] and default indices.

In [259]:
pd.Series([2,4,6,8])

0    2
1    4
2    6
3    8
dtype: int64

##### Q.20-	Write the output of the following code fragment. 
+ import pandas as pd
+ s2=pd.Series(["i","am", "a","student"]) 
+ print(s2)

In [260]:
s2 = pd.Series(['i','am','a','student'])
s2

0          i
1         am
2          a
3    student
dtype: object

##### Q.21-	Write the output of the following code fragment. 
+ import pandas as pd 
+ s1=pd.Series(200,index=range(2,13,2))
+ print(s1)

In [261]:
s1=pd.Series(200,index=range(2,13,2))
s1

2     200
4     200
6     200
8     200
10    200
12    200
dtype: int64

##### Q.22-	Write the output of the following code fragment. 
+ import pandas as pd
+ s1=pd.Series(range(2,11,2), index=[x for x in "abcde"])
+ print(s1)

In [263]:
s1=pd.Series(range(2,11,2), index=[x for x in "abcde"])
s1

a     2
b     4
c     6
d     8
e    10
dtype: int64

##### Q.23-	Write the output of the following code fragment. 
+ import pandas as pd
+ import numpy as np 
+ x=np.arange(10,15) 
+ s3=pd.Series(index=x, data=x*2) 
+ s4=pd.Series(x**2,x)
+ print(s3) 
+ print(s4)

In [264]:
x=np.arange(10,15) 
s3=pd.Series(index=x, data=x*2) 
s4=pd.Series(x**2,x)
print(s3) 
print(s4)

10    20
11    22
12    24
13    26
14    28
dtype: int32
10    100
11    121
12    144
13    169
14    196
dtype: int32

##### Q.24-	Sequences section and contribution store the section name ( 'A','B','C','D','E') and contribution (8900,8700,7800,6500,nil) for charity. Your school has decided to donate more contribution by each section, so donation has been doubled.
Write code to create series object that stores the contribution amount as the values and section name as indexes with data type as float32.

In [267]:
s = pd.Series([8900,8700,7800,6500, None], index = ['A','B','C','D','E'], dtype = np.float64)
s

A    8900.0
B    8700.0
C    7800.0
D    6500.0
E       NaN
dtype: float64

##### Q.25-	Write the output of the following code fragment. import pandas as pd
+ import numpy as np 
+ val1=np.arange(5.25,50,10.25) 
+ ser1=pd.Series(val1,index=['a','b','a','a','b']) 
+ print(ser1)
+ print(ser1['a'])
+ print(ser1['b'])

In [268]:
val1=np.arange(5.25,50,10.25) 
ser1=pd.Series(val1,index=['a','b','a','a','b']) 
print(ser1)
print(ser1['a'])
print(ser1['b'])

a     5.25
b    15.50
a    25.75
a    36.00
b    46.25
dtype: float64
a     5.25
a    25.75
a    36.00
dtype: float64
b    15.50
b    46.25
dtype: float64